//　123321是一个非常特殊的数，它从左边读和从右边读是一样的。
//　输入一个正整数n， 编程求所有这样的五位和六位十进制数，满足各位数字之和等于n 。
#include<stdio.h>

int main()
{
 int i,i1,i2,i3,i4,i5,i6;
 int n;
 scanf("%d",&n);
 for(i=10000;i<100000;i++){
i1=(i/10000);
i2=(i/1000%10);
i3=(i/100%10);
i4=(i/10%10);
i5=(i-i1*10000-i2*1000-i3*100-i4*10);
 if(i1==i5&&i2==i4&&(i1+i2+i3+i4+i5==n))
 printf("%d\n",i);
 }
 for(i=100000;i<1000000;i++){
i1=(i/100000);
i2=(i/10000%10);
i3=(i/1000%10);
i4=(i/100%10);
i5=(i/10%10);
i6=(i-i1*100000-i2*10000-i3*1000-i4*100-i5*10);
 if(i1==i6&&i2==i5&&i3==i4&&(i1+i2+i3+i4+i5+i6==n))
 printf("%d\n",i);
 }

return 0;
}